<template>
  <div class="comment-tree">
    <Comment v-for="comment in comments" :key="comment.id" :comment="comment" />
  </div>
</template>

<script setup lang="ts">
  /* const comments = [
    {
      id: 1,
      me: false,
      text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
      dateTime: '2024-05-05',
      comments: [
        {
          id: 1,
          me: false,
          text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
      ],
    },
    {
      id: 1,
      me: false,
      text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
      dateTime: '2024-05-05',
      comments: [
        {
          id: 1,
          me: false,
          text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
          comments: [
            {
              id: 1,
              me: false,
              text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
          ],
        },
        {
          id: 1,
          me: false,
          text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
        {
          id: 1,
          me: false,
          text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
      ],
    },
  ] */

  const comments = [
    {
      id: 1,
      me: false,
      text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
      dateTime: '2024-05-05',
      comments: [
        {
          id: 2,
          me: false,
          text: '2 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
        {
          id: 3,
          me: false,
          text: '3 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
          comments: [
            {
              id: 4,
              me: false,
              text: '4 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
            {
              id: 5,
              me: false,
              text: '5 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
              comments: [
                {
                  id: 6,
                  me: false,
                  text: '6 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                  dateTime: '2024-05-05',
                  comments: [
                    {
                      id: 8,
                      me: false,
                      text: '8 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                      dateTime: '2024-05-05',
                      comments: [
                        /* {
                          id: 9,
                          me: false,
                          text: '9 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                          dateTime: '2024-05-05',
                          comments: [
                            {
                              id: 10,
                              me: false,
                              text: '10 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                              dateTime: '2024-05-05',
                              comments: [
                                {
                                  id: 11,
                                  me: false,
                                  text: '11 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                                  dateTime: '2024-05-05',
                                  comments: [
                                    {
                                      id: 12,
                                      me: false,
                                      text: '12 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                                      dateTime: '2024-05-05',
                                      comments: [
                                        {
                                          id: 13,
                                          me: false,
                                          text: '13 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                                          dateTime: '2024-05-05',
                                          comments: [
                                            {
                                              id: 14,
                                              me: false,
                                              text: '14 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                                              dateTime: '2024-05-05',
                                              comments: [
                                                {
                                                  id: 15,
                                                  me: false,
                                                  text: '15 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                                                  dateTime: '2024-05-05',
                                                  comments: [
                                                    {
                                                      id: 16,
                                                      me: false,
                                                      text: '16 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                                                      dateTime: '2024-05-05',
                                                    },
                                                  ],
                                                },
                                              ],
                                            },
                                          ],
                                        },
                                      ],
                                    },
                                  ],
                                },
                              ],
                            },
                          ],
                        }, */
                      ],
                    },
                  ],
                },
                {
                  id: 7,
                  me: false,
                  text: '7 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                  dateTime: '2024-05-05',
                },
                {
                  id: 9,
                  me: false,
                  text: '9 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                  dateTime: '2024-05-05',
                },
                {
                  id: 10,
                  me: false,
                  text: '10 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
                  dateTime: '2024-05-05',
                },
              ],
            },
            {
              id: 4,
              me: false,
              text: '4 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
            {
              id: 4,
              me: false,
              text: '4 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
          ],
        },
      ],
    },
    {
      id: 101,
      me: false,
      text: '101 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
      dateTime: '2024-05-05',
      comments: [
        {
          id: 102,
          me: false,
          text: '102 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
        {
          id: 103,
          me: false,
          text: '103 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
      ],
    },
  ]
</script>
