<template>
  <div class="comment-tree">
    <Comment v-for="comment in comments" :key="comment.id" :comment="comment" />
  </div>
</template>

<script setup lang="ts">
  interface Props {
    comments: Comment[]
  }

  defineProps<Props>()
  

  /* const comments = [
    {
      id: 1,
      me: false,
      text: '1 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
      dateTime: '2024-05-05',
      comments: [
        {
          id: 2,
          me: false,
          text: '2 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
        {
          id: 3,
          me: false,
          text: '3 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
          comments: [
            {
              id: 4,
              me: false,
              text: '4 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
            {
              id: 5,
              me: false,
              text: '5 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',

            },
            {
              id: 4,
              me: false,
              text: '4 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
            {
              id: 4,
              me: false,
              text: '4 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
              dateTime: '2024-05-05',
            },
          ],
        },
      ],
    },
    {
      id: 101,
      me: false,
      text: '101 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
      dateTime: '2024-05-05',
      comments: [
        {
          id: 102,
          me: false,
          text: '102 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
        {
          id: 103,
          me: false,
          text: '103 Привет я пишу тебе какой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст текст тексткакой-то текст',
          dateTime: '2024-05-05',
        },
      ],
    },
  ] */
</script>
